# GetKeynoteTable Method (2024)

---
C#Visual BasicVisual C++
Revit 2024 API
---
KeynoteTable..::..GetKeynoteTable Method
KeynoteTable Class See Also
---
Gets the KeynoteTable from a Revit document.
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)**Since:** 2015
# Syntax
C#
---
```text
public static KeynoteTable GetKeynoteTable(
	Document aDoc
)
```

Visual Basic
---
```text
Public Shared Function GetKeynoteTable ( _
	aDoc As Document _
) As KeynoteTable
```

Visual C++
---
```text
public:
static KeynoteTable^ GetKeynoteTable(
	Document^ aDoc
)
```

# ### Parameters
aDoc
    Type: Autodesk.Revit.DB..::..Document The Revit document.
# ### Return Value
The KeynoteTable.
# Exceptions
| Exception | Condition |
| --- | --- |
| --- | --- |
| Autodesk.Revit.Exceptions..::..ArgumentNullException | A non-optional argument was null |

# See Also
KeynoteTable Class
Autodesk.Revit.DB Namespace